app/views/gossips/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<p>Gossips List :</p>
<% if User.find_by(id: session[:user_id]) %>

SELECT "gossips".* FROM "gossips"
---
<div id="conteneur_card">
  <% Gossip.all.each.with_index do |gossip, index| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 1]]
---
      <h5 class="card-title"> <%= gossip.title %></h5>
      <p class="card-text">Auteur: <%= gossip.user.first_name %></p>
      <p class="card-text">Commentaires: <%= Comment.where(gossip_id: gossip.id).count %></p>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        <%= link_to "Voir l'auteur", user_path(gossip.user_id),id: "ld", class: "card-link" %>
        <% if User.find_by(id: session[:user_id]) && gossip.user_id == User.find_by(id: session[:user_id]).id %>