app/views/layouts/application.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      <span class="nav-item nav-link active"> <%= link_to "Contact", welcome_contact_path %> </span>
      <% if User.find_by(id: session[:user_id]) %>